---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.ForwardIterator
source: html/be06b91a-5302-9387-8c74-04cb379667ab.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual VoltageTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.